# i = 4
# while i <= 20:
#     print(i)
#     i = i + 4

sum = 0 #შევქმენით ცვლადი (ჯამი) მისი მნიშვნელი 0
i = 100 #შევქმენა საიტერაციო ცვლადი
while i > 0: #შეიქმნა ციკლი რომლის ლიმიტი i ნაკლებია ან ტოლია 100-ზე
    sum += i #ჯამს მიემატება i საიტერაციო ცვლადი
    i -= 2 #იზრდება 2ით რათა მივიღოთ ლუწების ჯამი


print(sum)


# sum = 0 #შეიქმნა ჯამის ცვლადი
# i = 2 #შეიქმნა საიტერაციო ცვლადი
# while i <= 100: #შეიქმნა ციკლი რომელიც ნაკლებია ან ტოლია 100-ის
#    sum += i #ჯამს მიემატა საიტერაციო ცვლადი
#    i += 2 #იზრდება 2-ით რათა მივიღოთ ლუწების ჯამი
# print(sum) #დაიპრინტა ჯამი